In [1]:
import sqlite3

In [2]:
from sqlite3 import Error

In [3]:
import pandas as pd

In [4]:
#Creating a new db using python

def create_connection(db_file):
    """create db connection to SQLite Db"""
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [5]:
# if __name__=='__main__':
#     create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [6]:
create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

unable to open database file

In [7]:
conn = sqlite3.connect('pythonsqlite.db')

In [8]:
cur=conn.cursor()

 #### Creating a grocery list : Bananas (4), Peanut Butter (1), Dark Chocolate bars (2)

In [11]:
# #create table
cur.execute("""CREATE TABLE groceries (id INTEGER PRIMARY KEY, name TEXT, quantity INTEGER);""")

In [9]:
pd.DataFrame(cur.execute("""SELECT * FROM groceries;""").fetchall())

Empty DataFrame
Columns: []
Index: []

In [10]:
cur.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('quantity', None, None, None, None, None, None))

In [11]:
def sql_to_pd(query):
    df = pd.DataFrame(cur.execute(query).fetchall())
    df.columns = [x[0] for x in cur.description]
    return df

In [12]:
cur.execute("""INSERT INTO groceries VALUES (1,"Bananas", 4);""")

In [13]:
sql_to_pd("""SELECT * FROM groceries;""")

   id     name  quantity
0   1  Bananas         4

In [14]:
cur.execute("""INSERT INTO groceries VALUES (2, "Peanut Butter", 1);""")
cur.execute("""INSERT INTO groceries VALUES (3, "Dark Chocolate Bars", 2);""")

In [15]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity
0   1              Bananas         4
1   2        Peanut Butter         1
2   3  Dark Chocolate Bars         2

#### Add column

In [16]:
cur.execute("""ALTER TABLE groceries
                ADD aisle INTEGER;""")

In [17]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

In [18]:
cur.execute("""INSERT INTO groceries(aisle)
                VALUES (7)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

In [19]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas       4.0    NaN
1   2        Peanut Butter       1.0    NaN
2   3  Dark Chocolate Bars       2.0    NaN
3   4                 None       NaN    7.0
4   5                 None       NaN    2.0
5   6                 None       NaN    2.0

#### Delete rows

In [20]:
cur.execute("""DELETE FROM groceries WHERE id=4;""")
cur.execute("""DELETE FROM groceries WHERE id=5;""")
cur.execute("""DELETE FROM groceries WHERE id=6;""")

In [21]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

#### Update Value

In [22]:
cur.execute("""UPDATE groceries
                SET aisle = 7
                WHERE id = 1;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 2;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 3;""")

In [23]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2

In [24]:
cur.execute("""INSERT INTO groceries VALUES (4, "Ice Cream", 1, 12);""")
cur.execute("""INSERT INTO groceries VALUES (5, "Cherries", 6, 2);""")
cur.execute("""INSERT INTO groceries VALUES (6, "Chocolate Syrup", 1, 4);""")

In [25]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2
3   4            Ice Cream         1     12
4   5             Cherries         6      2
5   6      Chocolate Syrup         1      4

In [26]:
sql_to_pd("""SELECT * FROM groceries ORDER BY aisle;""")

   id                 name  quantity  aisle
0   2        Peanut Butter         1      2
1   3  Dark Chocolate Bars         2      2
2   5             Cherries         6      2
3   6      Chocolate Syrup         1      4
4   1              Bananas         4      7
5   4            Ice Cream         1     12

In [27]:
sql_to_pd("""SELECT * FROM groceries WHERE aisle>5 ORDER BY aisle;""")

   id       name  quantity  aisle
0   1    Bananas         4      7
1   4  Ice Cream         1     12

#### Aggregating Data

In [28]:
cur.execute("""SELECT SUM(quantity) FROM groceries;""").fetchall()

[(15,)]

In [29]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries;""")

   SUM(quantity)
0             15

In [30]:
sql_to_pd("""SELECT MAX(quantity) FROM groceries;""")

   MAX(quantity)
0              6

In [31]:
sql_to_pd("""SELECT name, MAX(quantity) FROM groceries;""")

       name  MAX(quantity)
0  Cherries              6

In [32]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries GROUP BY aisle;""")

   SUM(quantity)
0              9
1              1
2              4
3              1

In [33]:
sql_to_pd("""SELECT aisle, SUM(quantity) FROM groceries GROUP BY aisle;""")

   aisle  SUM(quantity)
0      2              9
1      4              1
2      7              4
3     12              1

### More Complex Queries

In [34]:
cur.execute("""CREATE TABLE excercise_logs (id INTEGER PRIMARY KEY AUTOINCREMENT, type TEXT, minutes INTEGER,
                calories INTEGER, heart_rate INTEGER);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);""")

In [35]:
sql_to_pd("""SELECT * FROM excercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

In [36]:
cur.execute("""ALTER TABLE excercise_logs
                RENAME TO exercise_logs;""")

In [37]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

#### AND Keyword

In [38]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 AND minutes<30;""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [39]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 OR heart_rate>100;""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

**And** has precedence over **or** if both are used in the same statement, but can use parenthesis to change the order of evaluation

#### Querying in Subqueries

In [40]:
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);""")

In [41]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   3        dancing       15       200         120
3   4  tree climbing       30        70          90
4   5  tree climbing       25        72          80
5   6         rowing       30        70          90
6   7         hiking       60        80          85

In [42]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105

In [43]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking" OR type="rowing" OR type = "hiking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   6  rowing       30        70          90
3   7  hiking       60        80          85

Instead, use IN operator

##### The **IN** Operator

In [44]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN ("biking","rowing","hiking","tree climbing");""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   4  tree climbing       30        70          90
3   5  tree climbing       25        72          80
4   6         rowing       30        70          90
5   7         hiking       60        80          85

##### Inverse query

In [45]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type NOT IN ("biking","rowing","hiking","tree climbing");""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [46]:
cur.execute("""CREATE TABLE drs_favorites
    (id INTEGER PRIMARY KEY,
    type TEXT,
    reason TEXT);""" )

cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("biking", "Improves endurance and flexibility.");""")
cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("hiking", "Increases cardiovascular health.");""")

In [47]:
sql_to_pd("""SELECT * FROM drs_favorites""")

   id    type                               reason
0   1  biking  Improves endurance and flexibility.
1   2  hiking     Increases cardiovascular health.

In [48]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites)""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   7  hiking       60        80          85

In [49]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason = "Increases cardiovascular health.");""")

   id    type  minutes  calories  heart_rate
0   7  hiking       60        80          85

Errors out if not exact match in the string. can also do a non exact match

##### LIKE Operator

In [50]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason LIKE "%cardiovascular%");""")

   id    type  minutes  calories  heart_rate
0   7  hiking       60        80          85

#### Restricting grouped results with HAVING

In [51]:
sql_to_pd("""SELECT type, SUM(calories) FROM exercise_logs GROUP BY type;""")

            type  SUM(calories)
0         biking            130
1        dancing            200
2         hiking             80
3         rowing             70
4  tree climbing            142

In [52]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type;""")

            type  total_calories
0         biking             130
1        dancing             200
2         hiking              80
3         rowing              70
4  tree climbing             142

WHERE only filters out individual logs. For aggregate, HAVING

In [53]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type HAVING total_calories>150;""")

      type  total_calories
0  dancing             200

In [54]:
sql_to_pd("""SELECT type, AVG(calories) AS average_calories FROM exercise_logs GROUP BY type
                HAVING average_calories>70""")

            type  average_calories
0        dancing             200.0
1         hiking              80.0
2  tree climbing              71.0

Only those activities which have been logged more than once: COUNT

##### COUNT Operator

In [55]:
sql_to_pd("""SELECT type FROM exercise_logs GROUP BY type HAVING COUNT(*)>=2;""")

            type
0         biking
1  tree climbing

#### Calculating results with CASE

In [56]:
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("dancing", 15, 165, 120);""")

In [57]:
sql_to_pd("""SELECT * from exercise_logs""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   3        dancing       15       200         120
3   4  tree climbing       30        70          90
4   5  tree climbing       25        72          80
5   6         rowing       30        70          90
6   7         hiking       60        80          85
7   8        dancing       15       165         120

Max heartrate is 220-age

In [58]:
sql_to_pd("""SELECT COUNT(*) from exercise_logs WHERE heart_rate > 220-28;""")

   COUNT(*)
0         0

Target heart rate: 50-90% of max

In [59]:
sql_to_pd("""SELECT COUNT(*) from exercise_logs WHERE heart_rate >= ROUND(0.5*(220-28)) AND heart_rate <= ROUND(0.9*(220-28));""")

   COUNT(*)
0         4

Summary of logs and how many in each zone. But we dont have a column for zones to use group by. Effectively create a column using the **CASE** statement.

In [60]:
sql_to_pd("""SELECT type, heart_rate FROM exercise_logs;""")

            type  heart_rate
0         biking         110
1         biking         105
2        dancing         120
3  tree climbing          90
4  tree climbing          80
5         rowing          90
6         hiking          85
7        dancing         120

In [61]:
sql_to_pd("""SELECT type, heart_rate,
                CASE
                    WHEN heart_rate > 220-28 THEN "above max"
                    WHEN heart_rate>= ROUND(0.9*(220-28)) THEN "above target"
                    WHEN heart_rate>= ROUND(0.5*(220-28)) THEN "within target"
                    ELSE "below target"
                END AS hr_zone
            FROM exercise_logs;""")

            type  heart_rate        hr_zone
0         biking         110  within target
1         biking         105  within target
2        dancing         120  within target
3  tree climbing          90   below target
4  tree climbing          80   below target
5         rowing          90   below target
6         hiking          85   below target
7        dancing         120  within target

In [62]:
sql_to_pd("""SELECT COUNT(*),
                CASE
                    WHEN heart_rate > 220-28 THEN "above max"
                    WHEN heart_rate>= ROUND(0.9*(220-28)) THEN "above target"
                    WHEN heart_rate>= ROUND(0.5*(220-28)) THEN "within target"
                    ELSE "below target"
                END AS hr_zone
            FROM exercise_logs
            GROUP BY hr_zone;""")

   COUNT(*)        hr_zone
0         4   below target
1         4  within target

##### Challenge: GradeBook

In [63]:
cur.execute("""CREATE TABLE student_grades (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    number_grade INTEGER,
    fraction_completed REAL);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winston", 90, 0.805);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winnefer", 95, 0.901);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winsteen", 85, 0.906);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Wincifer", 66, 0.7054);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winster", 76, 0.5013);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winstonia", 82, 0.9045);""")

In [64]:
sql_to_pd("""SELECT * FROM student_grades""")

   id       name  number_grade  fraction_completed
0   1    Winston            90              0.8050
1   2   Winnefer            95              0.9010
2   3   Winsteen            85              0.9060
3   4   Wincifer            66              0.7054
4   5    Winster            76              0.5013
5   6  Winstonia            82              0.9045

In [65]:
sql_to_pd("""SELECT name, number_grade,ROUND(fraction_completed*100) AS percent_completed FROM student_grades;""")

        name  number_grade  percent_completed
0    Winston            90               81.0
1   Winnefer            95               90.0
2   Winsteen            85               91.0
3   Wincifer            66               71.0
4    Winster            76               50.0
5  Winstonia            82               90.0

In [66]:
sql_to_pd("""SELECT COUNT(*),
    CASE
        WHEN number_grade > 90 THEN "A"
        WHEN number_grade > 80 THEN "B"
        WHEN number_grade > 70 THEN "C"
        ELSE "F"
    END AS letter_grade
FROM student_grades
GROUP BY letter_grade""")

   COUNT(*) letter_grade
0         1            A
1         3            B
2         1            C
3         1            F

### Relational Queries in SQL

#### JOINing Related tables

In [67]:
cur.execute("""CREATE TABLE students (id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    email TEXT,
    phone TEXT,
    birthdate TEXT);""")

cur.execute("""INSERT INTO students (first_name, last_name, email, phone, birthdate)
    VALUES ("Peter", "Rabbit", "peter@rabbit.com", "555-6666", "2002-06-24");""")

cur.execute("""INSERT INTO students (first_name, last_name, email, phone, birthdate)
    VALUES ("Alice", "Wonderland", "alice@wonderland.com", "555-4444", "2002-07-04");""")

#-----------------------------------------------------------------------------------------------------------------

cur.execute("""CREATE TABLE student_grades2 (id INTEGER PRIMARY KEY,
    student_id INTEGER,
    test TEXT,
    grade INTEGER);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (1, "Nutrition", 95);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (2, "Nutrition", 92);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (1, "Chemistry", 85);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (2, "Chemistry", 95);""")

In [68]:
sql_to_pd("""SELECT * FROM student_grades2""")

   id  student_id       test  grade
0   1           1  Nutrition     95
1   2           2  Nutrition     92
2   3           1  Chemistry     85
3   4           2  Chemistry     95

In [69]:
# Cross Join

sql_to_pd("""SELECT * FROM student_grades2,students""")

,id,student_id,test,grade,id,first_name,last_name,email,phone,birthdate
0,1,1,Nutrition,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
1,1,1,Nutrition,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
2,2,2,Nutrition,92,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
3,2,2,Nutrition,92,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
4,3,1,Chemistry,85,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
5,3,1,Chemistry,85,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
6,4,2,Chemistry,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
7,4,2,Chemistry,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04

In [70]:
# Inner Join Method 1: Implicit Inner Join

sql_to_pd("""SELECT * FROM student_grades2,students
                WHERE student_grades2.student_id=students.id""")

,id,student_id,test,grade,id,first_name,last_name,email,phone,birthdate
0,1,1,Nutrition,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
1,2,2,Nutrition,92,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
2,3,1,Chemistry,85,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
3,4,2,Chemistry,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04

In [71]:
# Inner Join Method 2: Explicit Inner Join

sql_to_pd("""SELECT * FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id""")

,id,first_name,last_name,email,phone,birthdate,id,student_id,test,grade
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,1,1,Nutrition,95
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,2,2,Nutrition,92
2,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,3,1,Chemistry,85
3,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,4,2,Chemistry,95

In [72]:
sql_to_pd("""SELECT first_name, last_name, email, test, grade FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Peter      Rabbit      peter@rabbit.com  Chemistry     85
3      Alice  Wonderland  alice@wonderland.com  Chemistry     95

In [73]:
sql_to_pd("""SELECT first_name, last_name, email, test, grade FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id
                WHERE grade>90""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Alice  Wonderland  alice@wonderland.com  Chemistry     95

What is 2 tables have same column names but different representation?

With such scenario, if we specify the column name in the SELECT statement, it wouldnt know which table to pull the grade from.

Therefore, best practice to prefix the columns in the statement: table_name.column_name

In [74]:
sql_to_pd("""SELECT students.first_name, students.last_name, students.email, student_grades2.test, student_grades2.grade FROM students
    JOIN student_grades2
    ON students.id = student_grades2.student_id
    WHERE grade > 90;""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Alice  Wonderland  alice@wonderland.com  Chemistry     95

#### Challenge: Bobby's Hobbies

In [75]:
cur.execute("""CREATE TABLE persons (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Bobby McBobbyFace", 12);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Lucy BoBucie", 25);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Banana FoFanna", 14);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Shish Kabob", 20);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Fluffy Sparkles", 8);""")


cur.execute("""CREATE table hobbies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    person_id INTEGER,
    name TEXT);""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (1, "drawing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (1, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (2, "dancing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (2, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "skating");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "rowing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "drawing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "dilly-dallying");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "meowing");""")

In [76]:
cur.execute("""INSERT INTO persons (name,age) VALUES ("Sweta Patel",29);""")
cur.execute("""INSERT INTO hobbies (person_id,name) VALUES (6,"reading books and hiking");""")

In [77]:
sql_to_pd("""SELECT persons.name, hobbies.name FROM persons
JOIN hobbies
ON persons.id=hobbies.person_id;""")

                 name                      name
0   Bobby McBobbyFace                   drawing
1   Bobby McBobbyFace                    coding
2        Lucy BoBucie                   dancing
3        Lucy BoBucie                    coding
4      Banana FoFanna                   skating
5      Banana FoFanna                    rowing
6      Banana FoFanna                   drawing
7         Shish Kabob                    coding
8         Shish Kabob            dilly-dallying
9         Shish Kabob                   meowing
10        Sweta Patel  reading books and hiking

In [78]:
sql_to_pd("""SELECT persons.name, hobbies.name FROM persons
JOIN hobbies
ON persons.id=hobbies.person_id
WHERE persons.name = "Bobby McBobbyFace";""")

                name     name
0  Bobby McBobbyFace  drawing
1  Bobby McBobbyFace   coding

#### Joining related tables with left outer joins

In [79]:
cur.execute("""CREATE TABLE student_projects (id INTEGER PRIMARY KEY,
    student_id INTEGER,
    title TEXT);""")

cur.execute("""INSERT INTO student_projects (student_id, title)
    VALUES (1, "Carrotapault");""")

In [80]:
sql_to_pd("""SELECT students.first_name,students.last_name, student_projects.title
                FROM students JOIN student_projects ON students.id=student_projects.student_id;""")

  first_name last_name         title
0      Peter    Rabbit  Carrotapault

Inner join only gives result if matching values in both tables. So, if we also want to see project of other student (even if they dont have a record.)

Here, outer join is useful

In [81]:
sql_to_pd("""SELECT students.first_name,students.last_name, student_projects.title
                FROM students LEFT OUTER JOIN student_projects ON students.id=student_projects.student_id;""")

  first_name   last_name         title
0      Peter      Rabbit  Carrotapault
1      Alice  Wonderland          None

In [82]:
sql_to_pd("""SELECT students.first_name,students.last_name, student_projects.title
                FROM students LEFT JOIN student_projects ON students.id=student_projects.student_id;""")

  first_name   last_name         title
0      Peter      Rabbit  Carrotapault
1      Alice  Wonderland          None

#### Challenge: Customer's orders

In [83]:
cur.execute("""CREATE TABLE customers (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    email TEXT);""")
cur.execute("""INSERT INTO customers (name, email) VALUES ("Doctor Who", "doctorwho@timelords.com");""")
cur.execute("""INSERT INTO customers (name, email) VALUES ("Harry Potter", "harry@potter.com");""")
cur.execute("""INSERT INTO customers (name, email) VALUES ("Captain Awesome", "captain@awesome.com");""")
cur.execute("""CREATE TABLE orders (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    customer_id INTEGER,
    item TEXT,
    price REAL);""")
cur.execute("""INSERT INTO orders (customer_id, item, price)
    VALUES (1, "Sonic Screwdriver", 1000.00);""")
cur.execute("""INSERT INTO orders (customer_id, item, price)
    VALUES (2, "High Quality Broomstick", 40.00);""")
cur.execute("""INSERT INTO orders (customer_id, item, price)
    VALUES (1, "TARDIS", 1000000.00);""")

In [84]:
sql_to_pd("""SELECT customers.name, customers.email, orders.item, orders.price FROM customers LEFT OUTER JOIN orders ON customers.id=orders.customer_id;""")

,name,email,item,price
0,Doctor Who,doctorwho@timelords.com,Sonic Screwdriver,1000.0
1,Doctor Who,doctorwho@timelords.com,TARDIS,1000000.0
2,Harry Potter,harry@potter.com,High Quality Broomstick,40.0
3,Captain Awesome,captain@awesome.com,None,NaN

In [85]:
sql_to_pd("""SELECT customers.name, customers.email, SUM(orders.price) FROM customers LEFT OUTER JOIN orders ON customers.id=orders.customer_id
GROUP BY customers.name
ORDER BY orders.price DESC;""")

              name                    email  SUM(orders.price)
0       Doctor Who  doctorwho@timelords.com          1001000.0
1     Harry Potter         harry@potter.com               40.0
2  Captain Awesome      captain@awesome.com                NaN

#### Joining tables to themselves with Self-Joins

In [86]:
cur.execute("""ALTER TABLE students
                ADD buddy_id INTEGER;""")

In [87]:
sql_to_pd("""SELECT * FROM students""")

,id,first_name,last_name,email,phone,birthdate,buddy_id
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,None
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,None

In [88]:
cur.execute("""UPDATE students
                SET buddy_id = 2
                WHERE id = 1;""")
cur.execute("""UPDATE students
                SET buddy_id = 1
                WHERE id = 2;""")

In [89]:
sql_to_pd("""SELECT * FROM students;""")

,id,first_name,last_name,email,phone,birthdate,buddy_id
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,2
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,1

In [90]:
cur.execute("""INSERT INTO students 
    VALUES (3, "Aladdin", "Lampland", "aladdin@lampland.com", "555-3333", "2001-05-10", 4);""")
cur.execute("""INSERT INTO students 
    VALUES (4, "Simba", "Kingston", "simba@kingston.com", "555-1111", "2001-12-24", 3);""")

In [91]:
sql_to_pd("""SELECT * FROM students;""")

,id,first_name,last_name,email,phone,birthdate,buddy_id
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,2
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,1
2,3,Aladdin,Lampland,aladdin@lampland.com,555-3333,2001-05-10,4
3,4,Simba,Kingston,simba@kingston.com,555-1111,2001-12-24,3

here, buddy id is the student id this student is linked with

Column related to another column in the same table

In [92]:
sql_to_pd("""SELECT students.first_name, students.last_name, buddies.email FROM students JOIN students buddies;""")

   first_name   last_name                 email
0       Peter      Rabbit      peter@rabbit.com
1       Peter      Rabbit  alice@wonderland.com
2       Peter      Rabbit  aladdin@lampland.com
3       Peter      Rabbit    simba@kingston.com
4       Alice  Wonderland      peter@rabbit.com
5       Alice  Wonderland  alice@wonderland.com
6       Alice  Wonderland  aladdin@lampland.com
7       Alice  Wonderland    simba@kingston.com
8     Aladdin    Lampland      peter@rabbit.com
9     Aladdin    Lampland  alice@wonderland.com
10    Aladdin    Lampland  aladdin@lampland.com
11    Aladdin    Lampland    simba@kingston.com
12      Simba    Kingston      peter@rabbit.com
13      Simba    Kingston  alice@wonderland.com
14      Simba    Kingston  aladdin@lampland.com
15      Simba    Kingston    simba@kingston.com

In [93]:
sql_to_pd("""SELECT students.first_name, students.last_name, buddies.email FROM students JOIN students buddies
                ON students.buddy_id = buddies.id;""")

  first_name   last_name                 email
0      Peter      Rabbit  alice@wonderland.com
1      Alice  Wonderland      peter@rabbit.com
2    Aladdin    Lampland    simba@kingston.com
3      Simba    Kingston  aladdin@lampland.com

In [94]:
sql_to_pd("""SELECT students.first_name, students.last_name, buddies.email as buddy_email FROM students JOIN students buddies
                ON students.buddy_id = buddies.id;""")

  first_name   last_name           buddy_email
0      Peter      Rabbit  alice@wonderland.com
1      Alice  Wonderland      peter@rabbit.com
2    Aladdin    Lampland    simba@kingston.com
3      Simba    Kingston  aladdin@lampland.com

#### Challenge: Sequel in SQL

In [95]:
cur.execute("""CREATE TABLE movies (id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    released INTEGER,
    sequel_id INTEGER);""")
cur.execute("""INSERT INTO movies 
    VALUES (1, "Harry Potter and the Philosopher's Stone", 2001, 2);""")
cur.execute("""INSERT INTO movies 
    VALUES (2, "Harry Potter and the Chamber of Secrets", 2002, 3);""")
cur.execute("""INSERT INTO movies 
    VALUES (3, "Harry Potter and the Prisoner of Azkaban", 2004, 4);""")
cur.execute("""INSERT INTO movies 
    VALUES (4, "Harry Potter and the Goblet of Fire", 2005, 5);""")
cur.execute("""INSERT INTO movies 
    VALUES (5, "Harry Potter and the Order of the Phoenix ", 2007, 6);""")
cur.execute("""INSERT INTO movies 
    VALUES (6, "Harry Potter and the Half-Blood Prince", 2009, 7);""")
cur.execute("""INSERT INTO movies 
    VALUES (7, "Harry Potter and the Deathly Hallows  Part 1", 2010, 8);""")
cur.execute("""INSERT INTO movies 
    VALUES (8, "Harry Potter and the Deathly Hallows  Part 2", 2011, NULL);""")

In [96]:
sql_to_pd("""SELECT movies.title, sequel.title as sequel_title FROM movies LEFT OUTER JOIN movies sequel ON movies.sequel_id=sequel.id;""")

,title,sequel_title
0,Harry Potter and the Philosopher's Stone,Harry Potter and the Chamber of Secrets
1,Harry Potter and the Chamber of Secrets,Harry Potter and the Prisoner of Azkaban
2,Harry Potter and the Prisoner of Azkaban,Harry Potter and the Goblet of Fire
3,Harry Potter and the Goblet of Fire,Harry Potter and the Order of the Phoenix
4,Harry Potter and the Order of the Phoenix,Harry Potter and the Half-Blood Prince
5,Harry Potter and the Half-Blood Prince,Harry Potter and the Deathly Hallows Part 1
6,Harry Potter and the Deathly Hallows Part 1,Harry Potter and the Deathly Hallows Part 2
7,Harry Potter and the Deathly Hallows Part 2,None

#### Combining Multiple Joins

In [97]:
cur.execute("""INSERT INTO student_projects (student_id, title)
    VALUES (2, "Mad Hattery");""")
cur.execute("""INSERT INTO student_projects (student_id, title)
    VALUES (3, "Carpet Physics");""")
cur.execute("""INSERT INTO student_projects (student_id, title)
    VALUES (4, "Hyena Habitats");""")

cur.execute("""CREATE TABLE project_pairs (id INTEGER PRIMARY KEY,
    project1_id INTEGER,
    project2_id INTEGER);""")
cur.execute("""INSERT INTO project_pairs (project1_id, project2_id)
    VALUES(1, 2);""")
cur.execute("""INSERT INTO project_pairs (project1_id, project2_id)
    VALUES(3, 4);""")

Review each others projects. example, hyena habitats should review carpet physics, etc. Project pairs: project ids that are paired with each other.

In [98]:
sql_to_pd("""SELECT a.title, b.title FROM project_pairs
    JOIN student_projects a
    ON project_pairs.project1_id = a.id
    JOIN student_projects b
    ON project_pairs.project2_id = b.id;""")

            title           title
0    Carrotapault     Mad Hattery
1  Carpet Physics  Hyena Habitats

But, more joins means slower queries :(

#### Challenge: FriendBook

In [99]:
sql_to_pd("""SELECT * FROM persons""")

   id               name  age
0   1  Bobby McBobbyFace   12
1   2       Lucy BoBucie   25
2   3     Banana FoFanna   14
3   4        Shish Kabob   20
4   5    Fluffy Sparkles    8
5   6        Sweta Patel   29

In [100]:
sql_to_pd("""SELECT * FROM hobbies""")

    id  person_id                      name
0    1          1                   drawing
1    2          1                    coding
2    3          2                   dancing
3    4          2                    coding
4    5          3                   skating
5    6          3                    rowing
6    7          3                   drawing
7    8          4                    coding
8    9          4            dilly-dallying
9   10          4                   meowing
10  11          6  reading books and hiking

In [101]:
cur.execute("""CREATE table friends (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    person1_id INTEGER,
    person2_id INTEGER);""")
cur.execute("""INSERT INTO friends (person1_id, person2_id)
    VALUES (1, 4);""")
cur.execute("""INSERT INTO friends (person1_id, person2_id)
    VALUES (2, 3);""")

In [102]:
sql_to_pd("""SELECT persons.name, hobbies.name as hobby FROM persons JOIN hobbies ON persons.id = hobbies.person_id;""")

                 name                     hobby
0   Bobby McBobbyFace                   drawing
1   Bobby McBobbyFace                    coding
2        Lucy BoBucie                   dancing
3        Lucy BoBucie                    coding
4      Banana FoFanna                   skating
5      Banana FoFanna                    rowing
6      Banana FoFanna                   drawing
7         Shish Kabob                    coding
8         Shish Kabob            dilly-dallying
9         Shish Kabob                   meowing
10        Sweta Patel  reading books and hiking

In [103]:
sql_to_pd("""SELECT a.name, b.name friend FROM friends
    JOIN persons a
    ON a.id = friends.person1_id
    JOIN persons b
    ON b.id = friends.person2_id;""")

                name          friend
0  Bobby McBobbyFace     Shish Kabob
1       Lucy BoBucie  Banana FoFanna

#### More efficient SQL with query planning and optimization

Now that you've learned many ways of selecting data and are starting to do `SELECT`s across multiple tables, it's a good time to talk about the efficiency of your SQL queries - how quickly do they execute, and could they execute faster?

SQL is a declarative language - each query declares what we want the SQL engine to do, but it doesn't say how.  As it turns out, the how -- the "plan" -- is what affects the efficiency of the queries, however, so it's pretty important.

**Why do SQL queries need a plan?**

For example, let's say we had this simple query:

`SELECT * FROM books WHERE author = "J K Rowling";`

For this query, these are 2 different ways that SQL could find the results:
- **Do a "full table scan":** look at every single row in the table, return the matching rows.
- **Create an "index":** Make a copy of the table sorted by author, then do a binary search to find the row where the author is "J K Rowling", find the matching IDs, then do a binary search on the original table that returns the rows that match the ID.

Which one is faster? It depends on the data, and on how often the query will be executed. If the table is only 10 rows long, then a full table scan only requires looking at 10 rows, and the first plan would work out well.

If the table was 10 million rows long, then that full table scan would require looking at 10 million rows. It would be faster to do a binary search on a sorted table - we only need 23 lookups to find a value in 10 million rows. However, creating the sorted table would take a while (~230 million operations, depending on our engine). If we were executing that query many times (more than 23 times) or if we already had that table created, then that second plan would be better.

How does a SQL engine decide which plan to pick? That's an important step that we haven't talked about yet, because we've been focused on the syntax of our queries, not their implementation. As you get into more advanced SQL usage on big databases, the planning step is increasingly important.

**The lifecycle of a SQL query**

We can think of the SQL engine going through these steps for each query we give it:

>Parse, then Optimize, then Execute

1. The query parser makes sure that the query is syntactically correct (e.g. commas out of place) and semantically correct (i.e. the tables exist), and returns errors if not. If it's correct, then it turns it into an algebraic expression and passes it to the next step.
2. The query planner and optimizer does the hard thinking work. It first performs straightforward optimizations (improvements that always result in better performance, like simplifying 5*10 into 50). It then considers different "query plans" which may have different optimizations, estimates the cost (CPU and time) of each query plan based on the number of rows in the relevant tables, then it picks the optimal plan and passes it on to the next step.
3. The query executor takes the plan and turns it into operations for the database, returning the results back to us if there are any.

**Where do humans come in?**

The query planning and optimization happens for every query, and you could go your whole life issuing SQL queries and not realize it. However, once you start dealing with bigger data sets, you'll start to care more about the speed of your queries, and you might find yourself wondering if there's any way you can improve the performance of your queries.

Many times, especially for complex queries, there are indeed ways you can help optimize a query, and that's known as **"query tuning"**.

The first step is to identify what queries you want to tune, which you can figure out by looking at which of your database calls are taking the longest or using the most resources, like with a SQL profiler. Sometimes, you might discover a badly performing query after it takes so long that it takes down your whole database. Hopefully, you find that out earlier.

The next step is to understand how a particular SQL engine is executing a query, and all SQL systems come with a way to ask the engine. In SQLite, you can stick `EXPLAIN QUERY PLAN` in front of any SQL to see what it's doing behind the scenes. If you use that, be prepared to dig deep into the `EXPLAIN QUERY PLAN` **reference**, because the "explanation" is pretty detailed and implementation specific. If you're using another SQL engine, you can search for **"how do I get an execution plan in X"**.

Now comes the hard part: manual optimization to improve that execution plan. This is also the part that is often dependent on the particularities of the SQL engine you're using, and the particularities of your own data.

For example, remember that query we discussed at the top? If we knew ahead of time that we would want to do hundreds of queries that restricted `WHERE` on the author column, then we could explicitly create the index, using `CREATE INDEX`. Then the SQL engine would be able to use that index to efficiently find the matching rows. You can read this guide about **SQLite query planning** to help you understand when indexes would help.

Creating indexes can often make repeated queries more efficient. But there are many other approaches as well. For SQLite, you can get more insight in their query planner overview and take careful note of the "manual" sections.

We can't cover all the complexities of query optimization and query tuning here, so I recommend that you dive deeper into it when you need it.

(Here are some deep dives into different SQL query planners that I found interesting: SQL Server Query Optimizer, Oracle SQL Tuning, MSSQL Execution Plan Basics)

https://www.khanacademy.org/computing/computer-programming/sql/relational-queries-in-sql/a/more-efficient-sql-with-query-planning-and-optimization

### Modifying Databases with SQL

#### Changing rows with UPDATE and DELETE

In [104]:
def sql(query):
    return cur.execute(query)

In [105]:
sql("""CREATE TABLE users (
    id INTEGER PRIMARY KEY,
    name TEXT);""")
sql("""CREATE TABLE diary_logs (
    id INTEGER PRIMARY KEY,
    user_id INTEGER,
    date TEXT,
    content TEXT
    );""")

In [106]:
sql("""INSERT INTO diary_logs (user_id, date, content) VALUES (1, "2015-04-01",
    "I had a horrible fight with OhNoesGuy and I buried my woes in 3 pounds of dark chocolate.");""")
sql("""INSERT INTO diary_logs (user_id, date, content) VALUES (1, "2015-04-02",
    "We made up and now we're best friends forever and we celebrated with a tub of ice cream.");""")

In [107]:
sql("""UPDATE diary_logs
        SET content="I had a horrible fight with OhNoesGuy"
        WHERE user_id = 1 AND date="2015-04-01";""")

# safer if we know the id

sql("""UPDATE diary_logs
        SET content="I had a horrible fight with OhNoesGuy"
        WHERE id = 1;""")

In [108]:
sql("""DELETE FROM diary_logs WHERE id=1;""")

In [109]:
sql_to_pd("""SELECT * FROM diary_logs""")

   id  user_id        date                                            content
0   2        1  2015-04-02  We made up and now we're best friends forever ...

Usually they dont delete data but create a new column deleted and have boolians/values for deleted true or false and based on what you need, they filter out the table if deleted is true.

#### Altering Tables after creation

##### Add Column

In [110]:
sql("""ALTER TABLE diary_logs ADD emotion TEXT""")

In [111]:
sql("""INSERT INTO diary_logs (user_id, date, content, emotion) VALUES (1, "2015-04-03",
    "We went to Disneyland!", "happy");""")

In [112]:
sql_to_pd("""SELECT * FROM diary_logs""")

,id,user_id,date,content,emotion
0,2,1,2015-04-02,We made up and now we're best friends forever ...,None
1,3,1,2015-04-03,We went to Disneyland!,happy

If we needed a default value instead of null, we specify it in the ALTER TABLE statement like: `ALTER TABLE diary_logs ADD emotion TEXT default "unknown"`

##### Deleting Entire Table

`DROP TABLE diary_logs`

#### Challenge: Clothing Alterations

In [113]:
sql("""CREATE TABLE clothes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    design TEXT);""")
sql("""INSERT INTO clothes (type, design)
    VALUES ("dress", "pink polka dots");""")
sql("""INSERT INTO clothes (type, design)
    VALUES ("pants", "rainbow tie-dye");""")
sql("""INSERT INTO clothes (type, design)
    VALUES ("blazer", "black sequin");""")

In [114]:
sql("""ALTER TABLE clothes ADD price NUMERIC default "not assigned";""")

sql_to_pd("""SELECT * FROM clothes;""")

   id    type           design         price
0   1   dress  pink polka dots  not assigned
1   2   pants  rainbow tie-dye  not assigned
2   3  blazer     black sequin  not assigned

In [115]:
sql("""UPDATE clothes SET price=10 WHERE id = 1;""")
sql("""UPDATE clothes SET price = 20 WHERE id = 2;""")
sql("""UPDATE clothes SET price = 30 WHERE id = 3;""")

sql_to_pd("""SELECT * FROM clothes;""")

   id    type           design  price
0   1   dress  pink polka dots     10
1   2   pants  rainbow tie-dye     20
2   3  blazer     black sequin     30

In [116]:
sql("""INSERT INTO clothes (type, design, price) VALUES ("camisole", "pastel", 19.99);""")

sql_to_pd("""SELECT * FROM clothes;""")

   id      type           design  price
0   1     dress  pink polka dots  10.00
1   2     pants  rainbow tie-dye  20.00
2   3    blazer     black sequin  30.00
3   4  camisole           pastel  19.99

#### Make SQL Safer

limit to 1: `UPDATE users SET deleted = true WHERE id = 1 LIMIT 1;` or if deleting: `DELETE users WHERE id = 1 LIMIT 1;`

##### Using Transactions

Whenever we issue a command like CREATE, UPDATE, INSERT, or DELETE, we are automatically starting a transaction. However, if we want, we can also wrap up multiple commands inside a bigger transaction. It may be that we only want an UPDATE to go through if another UPDATE goes through as well, so we want to put both of them in the same transaction.

In that case, we can wrap the commands in `BEGIN TRANSACTION` and `COMMIT`:

`BEGIN TRANSACTION;
UPDATE people SET husband = "Winston" WHERE user_id = 1;
UPDATE people SET wife = "Winnefer" WHERE user_id = 2;
COMMIT;`

If the database is unable to issue both those UPDATE commands for some reason, then it will rollback the transaction and leave the database how it was when it started.

We also use transactions when we want to make sure that all of our commands operate on the same view of the data - when we want to ensure that no other transactions operate on that same data while the sequence of commands is running. When you're looking at a sequence of commands you want to run, ask yourself what would happen if another user issued commands at the same time. Could your data end up in a weird state? In that case, you should run in a transaction.

For example, the following commands create a row denoting that a user earned a badge, and then update the user's recent activity to describe that:

`INSERT INTO user_badges VALUES (1, "SQL Master", "4pm");
UPDATE user SET recent_activity = "Earned SQL Master badge" WHERE id = 1;`

At the same time, another user or process might be awarding the user a second badge:

`INSERT INTO user_badges VALUES (1, "Great Listener", "4:05pm");
UPDATE user SET recent_activity = "Earned Great Listener badge" WHERE id = 1;`

These commands could now actually be issued in this order:

`INSERT INTO user_badges VALUES (1, "SQL Master");
INSERT INTO user_badges VALUES (1, "Great Listener");
UPDATE user SET recent_activity = "Earned Great Listener badge" WHERE id = 1;
UPDATE user SET recent_activity = "Earned SQL Master badge" WHERE id = 1;`

Their recent activity would now be "Earned SQL Master badge" even though the most recently inserted badge was "Great listener". That's not the end of the world, but it's also probably not what we expected.

Instead, we could run those in a transaction, to guarantee that no other transactions happen in the middle:

`BEGIN TRANSACTION;
INSERT INTO user_badges VALUES (1, "SQL Master");
UPDATE user SET recent_activity = "Earned SQL Master badge" WHERE id = 1;
COMMIT;`

##### Granting Privileges

`GRANT FULL ON TABLE users TO super_admin;`
`GRANT SELECT ON TABLE users TO analyzing_user;`